{
    "type": "table",
    "database": null,
    "name": "keto_recipe",
    "withoutRowId": false,
    "strict": false,
    "ddl": "CREATE TABLE \"keto_recipe\" (\"id\" integer NOT NULL PRIMARY KEY AUTOINCREMENT, \"title\" varchar(100) NOT NULL, \"description\" text NOT NULL, \"ingredients\" text NOT NULL, \"instructions\" text NOT NULL, \"created_at\" datetime NOT NULL, \"dish_type\" varchar(255) NOT NULL, \"calories\" integer NOT NULL, \"image\" varchar(100) NULL);",
    "columns": [
        {
            "name": "id",
            "type": "integer",
            "constraints": [
                {
                    "type": "NOT NULL",
                    "definition": "NOT NULL "
                },
                {
                    "type": "PRIMARY KEY",
                    "definition": "PRIMARY KEY AUTOINCREMENT"
                }
            ]
        },
        {
            "name": "title",
            "type": "varchar",
            "constraints": [
                {
                    "type": "NOT NULL",
                    "definition": "NOT NULL"
                }
            ]
        },
        {
            "name": "description",
            "type": "text",
            "constraints": [
                {
                    "type": "NOT NULL",
                    "definition": "NOT NULL"
                }
            ]
        },
        {
            "name": "ingredients",
            "type": "text",
            "constraints": [
                {
                    "type": "NOT NULL",
                    "definition": "NOT NULL"
                }
            ]
        },
        {
            "name": "instructions",
            "type": "text",
            "constraints": [
                {
                    "type": "NOT NULL",
                    "definition": "NOT NULL"
                }
            ]
        },
        {
            "name": "created_at",
            "type": "datetime",
            "constraints": [
                {
                    "type": "NOT NULL",
                    "definition": "NOT NULL"
                }
            ]
        },
        {
            "name": "dish_type",
            "type": "varchar",
            "constraints": [
                {
                    "type": "NOT NULL",
                    "definition": "NOT NULL"
                }
            ]
        },
        {
            "name": "calories",
            "type": "integer",
            "constraints": [
                {
                    "type": "NOT NULL",
                    "definition": "NOT NULL"
                }
            ]
        },
        {
            "name": "image",
            "type": "varchar",
            "constraints": [
                {
                    "type": null,
                    "definition": "NULL"
                }
            ]
        }
    ],
    "rows": [
        [
            1,
            "Кето-паскетарианский салат с авокадо",
            "Свежий салат с авокадо, огурцом и лососем.",
            "Авокадо, огурец, лосось, листья салата, оливковое масло, лимонный сок, соль, перец.",
            "Нарежьте ингредиенты, соедините их, добавьте масло и сок, посолите и поперчите.",
            "2024-03-09 14:51:33.293667",
            "Основные блюда",
            250,
            null
        ],
        [
            2,
            "Запеченные креветки с чесночным маслом",
            "Ароматные креветки в чесночном соусе, запеченные в духовке.",
            "Креветки, чеснок, оливковое масло, лимонный сок, петрушка, соль, перец.",
            "Приготовьте соус, обмажьте креветки, запекайте в духовке до готовности.",
            "2024-03-09 14:51:33.331963",
            "Основные блюда",
            350,
            null
        ],
        [
            3,
            "Кето-лосось с кунжутным кунжутом и апельсиново-медовым соусом",
            "Лосось с кунжутной корочкой и апельсиново-медовым соусом.",
            "Лосось, кунжут, мед, апельсин, специи.",
            "Обжарить лосось с кунжутом, подать с апельсиново-медовым соусом.",
            "2024-03-09 14:51:33.342467",
            "Основные блюда",
            450,
            null
        ],
        [
            4,
            "Кето-гуакамоле с овощами и чипсами из свеклы",
            "Гуакамоле с овощами и чипсами из свеклы, идеально для кето-питания.",
            "Авокадо, лук, помидор, оливки, лайм, свекла, специи.",
            "Приготовить гуакамоле, нарезать овощи, подавать с чипсами из свеклы.",
            "2024-03-09 14:51:33.351618",
            "Основные блюда",
            350,
            null
        ],
        [
            5,
            "Кето-сырные шарики со специями и орехами",
            "Закуска из сыра с орехами и специями, идеально для кето-питания.",
            "Сыр, грецкие орехи, специи.",
            "Смешать сыр, орехи, специи; сформировать шарики и охладить.",
            "2024-03-09 14:51:33.361518",
            "Закуски",
            250,
            null
        ],
        [
            6,
            "Кето-авокадо-йогуртовый дип с чипсами из капусты",
            "Дип из авокадо и йогурта, подается с низкоуглеводными чипсами из капусты.",
            "Авокадо, греческий йогурт, лайм, капуста, специи.",
            "Пюрировать авокадо и йогурт, добавить лайм и специи; подавать с чипсами из капусты.",
            "2024-03-09 14:51:33.372919",
            "Закуски",
            250,
            null
        ],
        [
            7,
            "Лосось с брокколи",
            "Полосатый лосось с запеченым брокколи.",
            "Лосось, брокколи, чеснок, лимон, оливковое масло, специи.",
            "Запекайте лосось и брокколи в духовке с приправами.",
            "2024-03-09 14:51:33.383091",
            "Основные блюда",
            500,
            null
        ],
        [
            8,
            "Рататуй",
            "Традиционное французское блюдо из запеченных овощей.",
            "Баклажан, кабачок, помидор, лук, чеснок, зелень, масло, специи.",
            "Нарежьте овощи, запекайте их в духовке с маслом и специями.",
            "2024-03-09 14:51:33.392565",
            "Закуски",
            150,
            null
        ],
        [
            9,
            "Жареный цветной перец с фетой",
            "Ароматный и сочный перец, запеченный с нежным фета-сыром.",
            "Цветной перец, фета, оливковое масло, лимонный сок, зелень, специи.",
            "Нарежьте перец кольцами, добавьте фету, запекайте в духовке до готовности.",
            "2024-03-09 14:51:33.402104",
            "Закуски",
            250,
            null
        ],
        [
            10,
            "Мексиканские кето-фаджитас с грибами",
            "Пикантные фаджитас с поджаренными грибами и аппетитными специями.",
            "Грибы, перец, лук, томаты, авокадо, специи, лимонный сок, масло.",
            "Обжарьте грибы с овощами и специями, подавайте с нарезанным авокадо.",
            "2024-03-09 14:51:33.412593",
            "Основные блюда",
            450,
            null
        ],
        [
            11,
            "Кето-паста из цуккини с песто",
            "Легкая и вкусная замена обычной пасты из цуккини с ароматным песто.",
            "Цуккини, базилик, орехи, чеснок, оливковое масло, лимонный сок, сыр, соль.",
            "Превратите цуккини в спагетти, приготовьте песто, соедините и подавайте.",
            "2024-03-09 14:51:33.422361",
            "Основные блюда",
            200,
            null
        ],
        [
            12,
            "Кето-гриль грибы с творожным соусом",
            "Ароматные грибы, запеченные на гриле и поданые с деликатным творожным соусом.",
            "Шампиньоны, лук, чеснок, творог, зелень, масло, соль, перец.",
            "Приготовьте соус из творога, обжарьте грибы на гриле, подавайте с соусом.",
            "2024-03-09 14:51:33.434245",
            "Основные блюда",
            200,
            null
        ],
        [
            13,
            "Кето-кус-кус из цветной капусты с лимонным дрессингом",
            "Легкое и освежающее блюдо из тертой цветной капусты с ароматным лимонным соусом.",
            "Цветная капуста, лимонный сок, оливковое масло, зелень, специи.",
            "Трите цветную капусту, добавьте дрессинг, посыпьте зеленью, подавайте.",
            "2024-03-09 14:51:33.444345",
            "Закуски",
            150,
            null
        ],
        [
            14,
            "Кето-авокадо с яйцом в запеченной чашке",
            "Нежное авокадо, запеченное с яйцом и пряными специями.",
            "Авокадо, яйцо, петрушка, специи, соль, перец.",
            "Вырежьте ямку в авокадо, добавьте яйцо, запекайте в духовке до готовности.",
            "2024-03-09 14:51:33.454298",
            "Основные блюда",
            250,
            null
        ],
        [
            15,
            "Кето-тушеный окунь с оливками и лимоном",
            "Нежный окунь, тушеный в ароматном соусе с оливками и свежим лимоном.",
            "Окунь, оливки, лимон, лук, зелень, оливковое масло, специи.",
            "Тушите окунь в соусе с оливками, лимоном и пряностями, подавайте горячим.",
            "2024-03-09 14:51:33.464455",
            "Основные блюда",
            450,
            null
        ],
        [
            16,
            "Кето-тунец с авокадо-лимонным дрессингом",
            "Ароматный тунец с кубиками авокадо и свежим лимонным соусом.",
            "Тунец, авокадо, лимонный сок, зелень, оливковое масло, специи.",
            "Приготовьте дрессинг, смешайте с кубиками тунца и авокадо, подавайте.",
            "2024-03-09 14:51:33.474182",
            "Основные блюда",
            350,
            null
        ],
        [
            17,
            "Кето-лосось на гриле с лимонным маслом",
            "Сочный лосось, приготовленный на гриле и заправленный лимонным маслом.",
            "Лосось, лимон, оливковое масло, зелень, специи, соль, перец.",
            "Запекайте лосось на гриле, полейте лимонным маслом, посыпьте зеленью.",
            "2024-03-09 14:51:33.488258",
            "Основные блюда",
            450,
            null
        ],
        [
            18,
            "Кето-кальмары с чесночным соусом",
            "Ароматные кальмары, обжаренные с чесночным соусом и специями.",
            "Кальмары, чеснок, лимон, масло, зелень, специи, соль, перец.",
            "Обжарьте кальмары, добавьте чесночный соус, посыпьте зеленью, подавайте.",
            "2024-03-09 14:51:33.496681",
            "Основные блюда",
            350,
            null
        ],
        [
            19,
            "Кето-запеченный филе трески в кунжутной корочке",
            "Нежное филе трески, запеченное в хрустящей кунжутной корочке.",
            "Филе трески, кунжут, соевый соус, имбирь, чеснок, лайм, специи.",
            "Обваляйте филе в кунжуте, запекайте до золотистости, подавайте с соусом.",
            "2024-03-09 14:51:33.506771",
            "Основные блюда",
            350,
            null
        ],
        [
            20,
            "Кето-кешью-тельное карри",
            "Ароматное карри с нежным кешью и разнообразными специями.",
            "Кешью, кокосовое молоко, специи, лук, чеснок, зелень, масло.",
            "Тушить кешью с специями, добавить кокосовое молоко, подавать с зеленью.",
            "2024-03-09 14:51:33.517916",
            "Основные блюда",
            350,
            null
        ],
        [
            21,
            "Кето-греческий салат с авокадо",
            "Свежий салат с огурцом, помидорами, оливками и кусочками авокадо.",
            "Огурец, помидор, оливки, авокадо, сыр фета, оливковое масло, уксус, травы.",
            "Нарезать овощи и авокадо, добавить сыр и соус, тщательно перемешать.",
            "2024-03-09 14:51:33.527995",
            "Основные блюда",
            200,
            null
        ],
        [
            22,
            "Кето-кунжутные лососики",
            "Сочные лососики, обваляемые в хрустящие кунжутные семечки.",
            "Лосось, кунжут, соевый соус, лимонный сок, имбирь, чеснок, специи.",
            "Обвалять лосось в кунжуте, запечь в духовке, подавать с соевым соусом.",
            "2024-03-09 14:51:33.538271",
            "Закуски",
            350,
            null
        ],
        [
            23,
            "Кето крем суп из брокколи",
            "Нежный и ароматный суп с кокосовым молоком и брокколи.",
            "Брокколи, кокосовое молоко, лук, чеснок, специи, масло, зелень.",
            "Готовить брокколи с луком и чесноком, добавить кокосовое молоко, измельчить в блендере.",
            "2024-03-09 14:51:33.548210",
            "Первые блюда",
            300,
            null
        ],
        [
            24,
            "Печеный кабачок с лимонным рисом",
            "Кабачок, запеченный на сковороде и подан с цитрусовым рисом.",
            "Кабачок, масло, лимон, чеснок, базмати рис (цветная), зелень.",
            "Печь кабачок, готовить рис с лимонным соком и кожурой, подавать вместе.",
            "2024-03-09 14:51:33.556716",
            "Основные блюда",
            170,
            null
        ],
        [
            25,
            "Кето-грибной ризотто с песто",
            "Аппетитный ризотто из цветной капусты с грибами и ароматным песто.",
            "Цветная капуста, грибы, сливки, песто, чеснок, лук, специи.",
            "Тушить грибы с цветной капустой, добавить сливки и песто, готовить до готовности.",
            "2024-03-09 14:51:33.567212",
            "Основные блюда",
            150,
            null
        ],
        [
            26,
            "Кето-спагетти из цукини с томатным соусом",
            "Здоровая замена пасты - спагетти из цукини с овощным томатным соусом.",
            "Цукини, томаты, лук, чеснок, оливковое масло, специи, зелень.",
            "Превратить цукини в спагетти, приготовить томатный соус, соединить, подавать.",
            "2024-03-09 14:51:33.577663",
            "Основные блюда",
            250,
            null
        ],
        [
            27,
            "Кето-гуакамоле с хрустящими овощами",
            "Свежий гуакамоле с ароматным авокадо и острой ноткой перца.",
            "Авокадо, помидоры, лук, лимон, чеснок, перец, зелень, овощи для чипсов.",
            "Пюрировать авокадо, добавить нарезанные овощи и специи, подавать с овощными чипсами.",
            "2024-03-09 14:51:33.588464",
            "Закуски",
            300,
            null
        ],
        [
            28,
            "Кето-перепелиные яйца с авокадо",
            "Нежные перепелиные яйца с кубиками авокадо в минималистичной подаче.",
            "Перепелиные яйца, авокадо, лимонный сок, оливковое масло, зелень, соль, перец.",
            "Отварить перепелиные яйца, комбинировать с авокадо, заправить маслом и лимонным соком.",
            "2024-03-09 14:51:33.598168",
            "Закуски",
            150,
            null
        ],
        [
            29,
            "Кето-цветная капуста гриль",
            "Цветная капуста, запеченная на гриле с ароматными специями.",
            "Цветная капуста, масло, чеснок, специи, лимонный сок, зелень.",
            "Нарезать цветную капусту, запечь на гриле с приправами, посыпать зеленью и соком лимона.",
            "2024-03-09 14:51:33.607309",
            "Основные блюда",
            200,
            null
        ],
        [
            30,
            "Кето-креветки в кокосовом молоке с карри",
            "Креветки, тушеные в кокосовом молоке с ароматными пряностями.",
            "Креветки, кокосовое молоко, карри-паста, лайм, чеснок, специи.",
            "Тушить креветки в кокосовом молоке с карри-пастой, добавить специи, подавать с ломтиками лайма.",
            "2024-03-09 14:51:33.617659",
            "Основные блюда",
            250,
            null
        ],
        [
            31,
            "Кето-тушеные мидии с чесночным маслом",
            "Нежные мидии, обжаренные в ароматном чесночном масле.",
            "Мидии, чеснок, лук, масло, белое вино, зелень, специи.",
            "Обжарить мидии с чесночным маслом, добавить лук, подлить вино, посолить, поперчить.",
            "2024-03-09 14:51:33.628342",
            "Основные блюда",
            300,
            null
        ],
        [
            32,
            "Кето-кальмары в томатном соусе с оливками",
            "Ароматные кальмары, тушеные в томатном соусе с добавлением оливок.",
            "Кальмары, томаты, лук, чеснок, оливки, зелень, специи.",
            "Тушить кальмары с овощами и оливками в томатном соусе, посыпать зеленью.",
            "2024-03-09 14:51:33.638531",
            "Основные блюда",
            250,
            null
        ],
        [
            33,
            "Кето-греческий салат со скумбрией",
            "Свежий греческий салат с добавлением жареной скумбрии.",
            "Скумбрия, помидор, огурец, маслины, оливковое масло, фета, специи.",
            "Обжарить скумбрию, смешать с овощами и фета, заправить маслом и специями.",
            "2024-03-09 14:51:33.648364",
            "Основные блюда",
            200,
            null
        ],
        [
            34,
            "Кето-лазанья из мидий с кокосовым кремом",
            "Оригинальное блюдо из мидий, слоенных с кокосовым кремом.",
            "Мидии, кокосовое молоко, лук, чеснок, специи, лимонный сок.",
            "Готовить слои мидий и крема, запекать в духовке до готовности.",
            "2024-03-09 14:51:33.659497",
            "Основные блюда",
            450,
            null
        ],
        [
            35,
            "Кето-тушеная кальмария с карри и лаймом",
            "Ароматная кальмария, приготовленная в карри-лаймовом соусе.",
            "Кальмар, карри, лайм, кокосовое молоко, чеснок, специи.",
            "Обжарить кальмар в соусе из карри, лайма и кокосового молока с чесноком.",
            "2024-03-09 14:51:33.669057",
            "Основные блюда",
            500,
            null
        ],
        [
            36,
            "Кето-ореховый хлеб с семенами",
            "Ароматный ореховый хлеб с добавлением семян для дополнительной хрустящести.",
            "Миндальная мука, льняные семена, орехи, яйца, оливковое масло, разрыхлитель, соль.",
            "Смешать ингредиенты, вылить тесто в форму, запекать в духовке до готовности.",
            "2024-03-09 14:51:33.679476",
            "Выпечка",
            400,
            null
        ],
        [
            37,
            "Кето-шоколадные маффины с авокадо",
            "Нежные и сочные маффины с шоколадом и кремовым авокадо.",
            "Миндальная мука, какао порошок, авокадо, яйца, стевия, разрыхлитель.",
            "Смешать ингредиенты, разлить в формы, запекать до готовности, украсить по желанию.",
            "2024-03-09 14:51:33.688936",
            "Выпечка",
            300,
            null
        ],
        [
            38,
            "Кето-кокосовые печенья с миндальным маслом",
            "Хрустящие кокосовые печенья с ароматом миндального масла.",
            "Кокосовая стружка, миндальное масло, яйца, стевия, ваниль, соль.",
            "Смешать ингредиенты, формировать печенья, запекать в духовке до золотистости.",
            "2024-03-09 14:51:33.698790",
            "Выпечка",
            200,
            null
        ],
        [
            39,
            "Кето-лимонный кекс с маком",
            "Нежный лимонный кекс с добавлением мака для текстуры и вкуса.",
            "Кокосовая мука, лимон, мак, яйца, оливковое масло, стевия, разрыхлитель.",
            "Смешать ингредиенты, вылить тесто в форму, запечь в духовке до проваривания.",
            "2024-03-09 14:51:33.713380",
            "Выпечка",
            250,
            null
        ],
        [
            40,
            "Кето-ванильные кексы с кокосовой глазурью",
            "Нежные ванильные кексы с ароматной кокосовой глазурью.",
            "Кокосовая мука, ваниль, кокосовое масло, яйца, стевия, изюм, разрыхлитель.",
            "Приготовить тесто, разлить в формы, запечь до готовности, покрыть глазурью.",
            "2024-03-09 14:51:33.727513",
            "Выпечка",
            350,
            null
        ],
        [
            41,
            "Шоколадные брауни с орехами",
            "Сочные шоколадные брауни с хрустящими орехами.",
            "Миндальная мука, какао, мед, яйца, орехи, разрыхлитель, ваниль.",
            "Смешайте все ингредиенты, выложите в форму, запекайте до приготовления.",
            "2024-03-09 14:51:33.736954",
            "Выпечка",
            300,
            null
        ],
        [
            42,
            "Лимонные кокосовые маффины",
            "Сочные маффины с ярким лимонным вкусом и кокосовой текстурой.",
            "Кокосовая мука, лимонная цедра, яйца, мед, лимонный сок, разрыхлитель, соль.",
            "Смешайте ингредиенты, разложите в формы, запечь до готовности.",
            "2024-03-09 14:51:33.748918",
            "Выпечка",
            200,
            null
        ],
        [
            43,
            "Овсяно-трюфельное печенье",
            "Питательное и ароматное печенье с овсянкой и шоколадными трюфелями.",
            "Овсянка, миндальная мука, какао, мед, масло кокоса, шоколадные трюфели.",
            "Смешайте все ингредиенты, сформируйте печенье, выложите трюфели, запекайте.",
            "2024-03-09 14:51:33.757577",
            "Выпечка",
            150,
            null
        ],
        [
            44,
            "Миндальные рулетики с кокосом",
            "Нежные рулетики с миндальной начинкой и ароматным кокосом.",
            "Миндальная мука, кокосовая стружка, яйцо, мед, ваниль, масло кокоса.",
            "Смешайте ингредиенты, распределите начинку на тесте, скрутите в рулет, запекайте.",
            "2024-03-09 14:51:33.768259",
            "Выпечка",
            200,
            null
        ],
        [
            45,
            "Кокосовые пироги с ягодами",
            "Нежные кокосовые пироги с ягодной начинкой.",
            "Кокосовая мука, яйца, кокосовое масло, ягоды, мед, разрыхлитель.",
            "Смешайте муку, яйца, масло, мед и разрыхлитель, разделите тесто на порции, добавьте ягоды, запекайте.",
            "2024-03-09 14:51:33.777726",
            "Выпечка",
            400,
            null
        ],
        [
            46,
            "Крем-суп из картофеля и цветочной капусты",
            "Нежный и ароматный суп с картофелем и цветочной капустой, подходит для вегетарианцев и кето диеты.",
            "Картофель, цветочная капуста, лук, чеснок, оливковое масло, овощной бульон, кокосовое молоко, специи.",
            "Обжарьте лук и чеснок, добавьте картофель и цветочную капусту, залейте бульоном, варите до мягкости овощей, добавьте кокосовое молоко, специи, размельчите блендером.",
            "2024-03-09 14:51:33.786727",
            "Первые блюда",
            200,
            null
        ],
        [
            47,
            "Крем-суп из брокколи и сыра",
            "Сытный и вкусный суп с брокколи и сыром, идеально подходит для кето-питания.",
            "Брокколи, лук, сливочное масло, сыр чеддер, кокосовое молоко, соль, перец.",
            "Обжарьте лук, добавьте брокколи, залейте водой или бульоном, варите до мягкости, добавьте сливочное масло, кокосовое молоко, сыр и специи, разомните блендером.",
            "2024-03-09 14:51:33.799786",
            "Первые блюда",
            300,
            null
        ],
        [
            48,
            "Кокосовый чеддер суп с грибами",
            "Ароматный суп с кокосовым молоком, сыром чеддер и грибами.",
            "Грибы, лук, чеснок, кокосовое молоко, сыр чеддер, специи, оливковое масло.",
            "Обжарьте лук и чеснок, добавьте грибы, обжарьте, залейте кокосовым молоком, доведите до кипения, добавьте сыр, специи, перемешайте до растворения сыра, подавайте горячим.",
            "2024-03-09 14:51:33.810892",
            "Первые блюда",
            350,
            null
        ],
        [
            49,
            "Миндальные булочки с семенами чиа",
            "Пышные булочки с миндальной мукой и ароматными семенами чиа, идеально подходят для кето-диеты.",
            "Миндальная мука, семена чиа, яйца, кокосовое масло, разрыхлитель, соль.",
            "Смешайте миндальную муку, семена чиа, яйца, разрыхлитель и соль, формируйте булочки, запекайте до золотистого цвета.",
            "2024-03-09 14:51:33.822956",
            "Выпечка",
            250,
            null
        ],
        [
            50,
            "Миндальное печенье с цитрусовой цедрой",
            "Ароматное миндальное печенье с ярким цитрусовым вкусом.",
            "Миндальная мука, цитрусовая цедра, яйца, мед, разрыхлитель, ваниль.",
            "Смешайте миндальную муку, цитрусовую цедру, яйца, мед, разрыхлитель и ваниль, сформируйте печенье, запекайте в духовке.",
            "2024-03-09 14:51:33.835948",
            "Выпечка",
            150,
            null
        ]
    ]
}