[
{
    "model": "keto.ketoarticle",
    "pk": 1,
    "fields": {
        "title": "Распространенные заблуждения о кетодиете",
        "content": "В этой статье я собрала для вас самые популярные возражения против кетодиеты, которые не имеют под собой ничего, кроме сомнений. 1. Кетоз опасен! Нет. Физиологический кетоз - абсолютно естественное состояние организма при ограничении поступления еды извне. Например, во время сна или длительного голодания. Новорожденные дети входят в состояние физиологического кетоза уже через 2 часа после еды. Они вообще большую часть времени находятся в кетозе. Когда человек спит, печень вырабатывает кетоновые тела для питания спящего тела. Как вы думаете, как вам удаётся обходиться 8-10 часов без еды ночью? Благодарите печень и Создателя за кетоз. 2. Есть опасность кетоацидоза при переходе на кето! Кетоацидоз - это закисление крови вследствие одновременно высокого уровня глюкозы крови, высокого уровня кетонов, и практически полного отсутствия инсулина в крови. Опасное для здоровья состояние, которым любят пугать всех без исключения противники кето диеты. А теперь, внимание! Кетоацидоз возникает исключительно у людей с инсулинозависимым сахарным диабетом 1 типа! То есть у тех, чья поджелудочная железа НЕ производит собственный инсулин. У человека с нормально функционирующей поджелудочной железой кетоацидоза не бывает. В том числе и у людей с инсулиннезависимым сахарным диабетом 2 типа. 3. Придется есть один жир! Нет. Тарелка приверженца кетодиеты полна овощей и зелени. Совершенно точно не нужно есть сало со сливочным маслом, и запивать это оливковым маслом)) Да, выбор продуктов несколько сужается, но тем не менее вся еда полноценна и очень вкусна. 4. Если есть столько жиров, то это приведет к инсульту/инфаркту/атеросклерозу! Нет. С тех пор, как жиры обвинили в развитии сердечно-сосудистых заболеваний, ни одно исследование не смогло это доказать. Зато полно исследований, показывающих связь между высоким уровнем холестерина в крови пожилых людей, и уменьшением риска деменции и болезни Альцгеймера. Более того: сердечная мышца 70% энергии получает из жирных кислот и кетоновых тел. Это предпочтительный вид топлива для сердца. 5. Такой тип питания опасен для почек! Нет. Для почек опасно большое количество белка. А кето - умеренное по белку питание. Белка человек ест столько, чтобы хватало на ремонт и строительство новых клеток. Это около 300г белковых продуктов за весь день. 6. Мозгу нужна глюкоза для жизнедеятельности! Не совсем так. Почти все клетки человеческого тела способны получать энергию и из глюкозы, и из кетонов, причём последние предпочтительнее, потому что дают больше энергии, и меньше отходов. Клетки мозга на кетогенном питании работают гораздо эффективнее. Все приверженцы кетопитания отмечают улучшение памяти, внимания, способности сосредоточиться. 6. Кето нельзя придерживаться долго! Это тоже неверное утверждение. Я придерживаюсь кето с 2014 года, и не собираюсь заканчивать кето в ближайшие лет 40-50. Знаю людей, которые придерживаются низкоуглеводного высокожирового питания и 15, и 20 лет, считают это питание своим образом жизни, и всем своим цветущим видом опровергают данное заблуждение. Это самые популярные возражения, с которыми я сталкиваюсь регулярно. Предлагаю Вам самостоятельно сравнить своё состояние в настоящее время, и через какое-то время после начала кето. Думаю, Вы будете удовлетворены своим здоровьем и самочувствием.",
        "author": "Вера Владимирова @etoproketo",
        "created_at": "2024-03-09T19:45:12.972Z"
    }
},
{
    "model": "keto.ketoarticle",
    "pk": 2,
    "fields": {
        "title": "Показания и противопоказания к кето",
        "content": "Какие состояния улучшаются на кето диете, а при каких состояниях не стоит начинать кето - в этой статье.Если Вы уже узнали про существование низкоуглеводного высокожирового питания (кето, LCHF), но сомневаетесь, можно ли Вам начинать такое питание, то можете ознакомиться с абсолютными и относительными противопоказаниями к кето, а также, возможно, Вы узнаете себя в списке тех, кому просто необходимо как можно скорее начать кето.Кому подойдёт кето:Людям с инсулинорезистенстностью Инсулинорезистентность - метаболическое состояние организма, характеризующееся снижением чувствительности клеток к инсулину при относительно нормальном уровне глюкозы крови. Низкоуглеводное высокожировое питание помогает вернуть клеткам тела чувствительность к инсулину и метаболическую гибкость, снизить вес до нормального, уплотнить мышцы и кости, и в целом стать здоровее. Рекомендую начать кето как можно скорее! Людям с метаболическим синдромом Метаболический синдром - следующий за инсулинорезистентностью этап, характеризующийся висцеральным ожирением, гипертонией, постоянно повышенными уровнями глюкозы и холестерина в крови. Жизнь с метаболическим синдромом тяжела, и полна боли и страданий. В этом случае я также рекомендую начинать кето сразу же, не откладывая на потом! Раньше начнёте - раньше и придут былые стройность и здоровье!Избавиться от метаболического синдрома возможно полностью, следуя строгому плану кето Людям с сахарным диабетом 1 и 2 типа Сахарный диабет 1 типа - это аутоиммунное заболевание, при котором организм не вырабатывает инсулин. Следование низкоуглеводному плану питания позволяет упростить контроль сахара в крови, и лучше регулировать дозы инсулина.Сахарный диабет 2 типа - болезнь \"образа жизни\", характеризующаяся постоянной гипергликемией и избыточной массой тела, осложнённая, как правило, следующими состояниями: хроническая почечная недостаточность, ретинопатия, полинейропатия, диабетическая стопа, стенокардия, инфаркт миокарда. Современная классическая схема \"лечения\" не вернёт Вам здоровье, и не обратит диабет вспять. Сначала слабые таблетки, потом таблетки посильнее, потом уколы + таблетки. Потом бесславный конец. Сахар возвращается в норму через две-три недели от начала кето, а сахарный диабет полностью обратим буквально в течение трёх-шести месяцев, при условии следования строгому кето-рациону. Хотите быть здоровыми? Снижайте вес, и вслед за стройностью придёт и здоровье! При жировом гепатозе (ожирении печени, стеатозе) Ожирение печени - отложение триглицеридов в клетках печени. Основная причина жирового гепатоза - излишек поступающей с едой фруктозы (употребление сахара, мёда, сладких селекционированных фруктов круглогодично, покупных кондитерских изделий, фруктозы как заменителя сахара). Ожирение печени обычно никак себя не проявляет, и обнаруживается случайно при УЗИ брюшной полости. Характерный визуальный признак стеатогепатоза - сильно выпирающий вперёд живот как у полных, так и у относительно стройных людей. Низкоуглеводное высокожировое питание (LCHF, кето) позволяет вернуть здоровье печени, избавив её от жировых отложений уже через полгода-год. Начинать кето лучше всего под руководством опытного тренера, с ежедневным контролем съеденного и коррекцией рациона в реальном времени. Кому противопоказано кето: Есть абсолютные противопоказания, то есть такие состояния, при которых кето категорически не рекомендуется, и есть относительные противопоказания, при которых кето возможно с соблюдением некоторых условий. Абсолютные противопоказания: Это, как правило, врождённые и/или наследственные нарушения метаболизма жиров:- системный первичный дефицит карнитина - недостаточность карнитин пальмитоилтрансферазы - дефицит среднецепочечной ацил-КоА дегидрогеназы- дефицит длинноцепочечной ацил-КоА дегидрогеназы- дефицит фермента пируват карбоксилазы.Также абсолютными противопоказаниями являются приобретённые болезни:- хроническая почечная недостаточность - цирроз печени.Относительные противопоказания: Это такие состояния, при которых кето возможно, однако перед началом низкоуглеводного высокожирового питания необходима консультация врача, а также Ваше собственное решение об изменении питания, с учётом информации ниже.Желчнокаменная болезнь, удалённый жёлчный.При данных состояниях затруднено полноценное переваривание жиров. Попросту говоря, жёлчи может не хватать для полной эмульгации возросшего количества жиров в рационе.При наличии мелких камней в желчном пузыре возможна закупорка желчного протока и приступ холецистита после увеличения количества жиров в рационе. Этот момент следует учитывать. При наличии крупных камней такого эффекта не наблюдается.В данном случае низкоуглеводное высокожировое питание возможно с соблюдением следующих условий:- не менее трёх приёмов пищи в день - приём препаратов желчи после еды - при удалённом желчном возможно употребление небольшого количества сливочного масла, чтобы нейтрализовать постоянно выделяющуюся в кишку желчь. Рекомендую начинать кето под наблюдением лечащего врача, и опытного тренера по кето-питанию. Гипотиреоз.Устойчивое снижение функции щитовидной железы с замедлением метаболизма. В данном случае низкоуглеводное высокожировое питание возможно с соблюдением следующих условий:- 3 полноценных приёма пищи с высокой калорийностью - без искусственного дефицита калорий - без соблюдения интервального голодания. Также рекомендуется наблюдение врача, и ежедневный контроль рациона опытным кето-коучем. Хронический панкреатит. При наличии этого заболевания обязательно проконсультируйтесь с лечащим врачом до начала низкоуглеводного высокожирового питания. Возможно как улучшение самочувствия, так и резкое ухудшение. Зависит от того, какой из отделов поджелудочной железы воспалён. И если Вы принимаете решение начать кетопитание, то следует избегать в рационе того, что будет провоцировать обострение. Наследственная семейная гиперхолестеринемия. В данном случае рекомендуется вместо насыщенных и полиненасыщенных жиров использовать мононенасыщенные жиры, которые не участвуют в образовании \"плохого\" холестерина. Веганство. Практически невозможно соблюсти кето-пропорцию БЖУ, используя в своём питании только растительные источники. Вы можете попробовать использовать аминокислотные добавки и дополнительные витамины. Любое расстройство пищевого поведения.Поскольку список продуктов для кето весьма ограничен, у человека с РПП могут возникнуть трудности с новым стилем питания. Объективно оценивайте свои силы в этом случае. Обсудите возможность нового питания со специалистом. Принимайте решение взвешенно. Не являются противопоказаниями к кето следующие состояния:- хронический гастрит - язва желудка - синдром раздражённого кишечника - любые другие проблемы с ЖКТ - поликистоз яичников- эндометриоз - другие заболевания мочеполовой системы- лёгочная гипертензия- другие лёгочные заболевания- сердечно-сосудистые заболевания- недостаточная масса тела- нормальная масса тела- возраст 50+- гипотония- подагра- беременность и кормление грудью.Начинать кето можно в любом случае, кроме перечисленных в списке абсолютных противопоказаний. Дерзайте!",
        "author": "Вера Владимирова @etoproketo",
        "created_at": "2024-03-09T19:45:13.022Z"
    }
},
{
    "model": "keto.ketoarticle",
    "pk": 3,
    "fields": {
        "title": "С чего начать кето?",
        "content": "Если Вы только планируете попробовать кето-питание, но не знаете, с чего начать, то Вам поможет эта статья. Первое, с чего нужно начать - это зачистка кухни. Избавьтесь от запасов - круп - макаронных изделий - хлебобулочных изделий - картофеля - сахара - варений, джемов - мясных полуфабрикатов - колбасных изделий - майонеза, кетчупов, соевого соуса - подсолнечного масла. Затем отправляйтесь по магазинам с новым списком, в котором должны быть следующие продукты: - самая жирная рыба (сельдь, скумбрия, палтус, терпуг и т.д.) - самые жирные куски мяса, птицы - субпродукты - оливковое масло первого отжима - сливочное масло 82% - капуста: белокочанная, брокколи, цветная, брюссельская, пекинская - различная листовая зелень (салат, шпинат, руккола, зелёный лук, укроп, петрушка и т.д.) - огурцы, грибы - стеблевой сельдерей - трубчатые кости и суставы для приготовления питательного бульона - лимоны, лайм, авокадо - натуральный яблочный уксус. Далее приступайте к готовке. Из того, что Вы купили, можно приготовить много разных вкусных блюд. К тому же, большинство блюд кето-диеты просты, и требуют минимум времени и усилий. Например: поставили в духовку рыбу, сбрызнутую лимонным соком, и пока она запекается, быстро нашинковали капусту, добавили яблочного уксуса, помяли, сюда же огурчик/стеблевой сельдерей, различную зелень, заправили оливковым маслом. Вот и ужин готов!",
        "author": "Вера Владимирова @etoproketo",
        "created_at": "2024-03-09T19:45:13.031Z"
    }
}
]
